/**
 *

 第一步，首先你要了解JAVA

 为什么要了解java? 这个当然很重要你既然要学习java肯定要了解它，它可以干什么，做什么，有什么特性，用在哪儿？什么多线程，什么多态性，什么面向对象，什么移植性balabalabala等等等，对不对，以后你真成了高手了不还可以和人家家谈谈java的历史嘛，哪怕某天有人问你java和javascript有什么区别，你也不会回答说“多了个script”吧。

 Java 简介


 第二步，JAVA程序环境

 了解了语言历史，特性之后，也该动动手了吧，不能光看不练嘛，那么要动手肯定要先搭建环境。

 下载JDK
 配置环境变量
 验证配置环境变量
 Java 开发环境配置


 第三步，JAVA基本程序设计结构

 环境搭建好了就可以开始边学边练习了，在这我简单分下知识点：

 数据类型 >> Java 基本数据类型
 变量 >> Java 变量类型
 运算符 >> Java 运算符
 字符串 >> Java基础字符、字符串
 输入输出 >> JAVA输入输出流学习
 控制流程 >> JAVA流程控制
 大数值 >> JAVA大数值
 数组 >> Java 数组

 第四步，对象和类

 面向对象程序简称oop，是当今主流程序设计范型，面向对象程序设计于面向过程程序设计还是有一定的区别的，如果不懂建议好好学习。

 类，使用现有类 >> Java经典教程什么是类?Java使用现有的类
 用户自定义类 >> Java用户自定义类
 静态域于静态方法 >> Java静态域与静态方法
 方法参数 >> java中方法的参数传递机制
 对象构造 >> JAVA对象的构造和初始化
 包 >> Java 包(package)
 路径类 >> JAVA类路径说明(新手必读)
 类的设计技巧 >> Java中类的设计技巧

 第五步，继承

 超类，子类 >> Java 继承，类，超类和子类
 Object >> Java中的Object对象理解
 泛型数组列表 >> 泛型数组列表
 对象自动打包 >> Java对象包装器 自动打包解包
 枚举类 >> Java 枚举类的基本使用
 反射 >> Java反射机制详解

 第六步，接口 and 内部类

 接口 >> Java接口_百度百科
 对象克隆 >> JAVA对象的克隆
 接口和回调 >> 回调函数、Java接口回调总结
 内部类 >> 内部类详解

 第七步，Swing图形程序

 Swing框架 >> Swing开发包

 第八步，事件处理

 事件处理 >> Java程序设计-事件处理
 动作 >> JAVA入门之Swing如何监听用户动作

 第九步，部署应用程序

 jar文件 >> java 可执行Jar包打包方法
 Java web start >> Java Web Start完整的开发和调用
 Applet >> 教你构建第一个Java Applet程序

 第十步，异常，日志，断言和调试

 处理异常 >> Java中如何正确处理异常
 捕获异常 >> 深入理解Java异常处理机制
 断言 >> Java断言开启、断言使用
 记录日志 >> JAVA日志记录方法
 调试 >> Java程序员应该知道的10个调试技巧

 第十一步，泛型程序

 约束和局限性 >> Java泛型•约束和局限性
 继承规则 >> Java泛型 泛型类型的继承规则
 通配符类型 >> java 泛型详解（普通泛型、 通配符、 泛型接口）
 反射和泛型 >> Java泛型和反射机制

 第十二步，集合

 集合接口 >> Java 集合中主要接口的介绍
 集合框架 >> Java - 集合框架完全解析
 集合算法 >> Java的集合之算法篇
 遗留的集合 >> java集合--遗留的集合

 第十三步，多线程

 线程属性 >> JAVA线程5 - 线程属性
 同步 >> Java 多线程同步的五种方法
 阻塞队列 >> Java中的阻塞队列
 线程安全的集合 >> Java多线程理解：线程安全的集合对象
 执行器 >> Java多线程--执行器
 同步器 >> Java多线程编程之同步器
 编辑于 2017-04-20
 */
package com.example.yangjie.study;

